In [2]:
import pandas as pd
import numpy as np

In [33]:
df = pd.read_csv("dane/gini/gini_0.csv", delimiter = ",", on_bad_lines='skip')

In [34]:
df.info

<bound method DataFrame.info of           STRUCTURE                STRUCTURE_ID ACTION FREQ FREQ_LABEL  \
0     datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
1     datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
2     datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
3     datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
4     datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
...             ...                         ...    ...  ...        ...
2397  datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
2398  datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
2399  datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
2400  datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual
2401  datastructure  WB.DATA360:DS_DATA360(1.3)      I    A     Annual

     REF_AREA REF_AREA_LABEL           INDICATOR INDICATOR_LABEL SEX  ...  \
0         USA  United States  WB_WDI_SI_POV_GINI      Gini index  _T  ...
1         USA  United States  WB_WDI_SI_POV_GINI      Gini index  _T  ...
2         USA  United States  WB_WDI_SI_POV_GINI      Gini index  _T  ...
3         USA  United States  WB_WDI_SI_POV_GINI      Gini index  _T  ...
4         USA  United States  WB_WDI_SI_POV_GINI      Gini index  _T  ...
...       ...            ...                 ...             ...  ..  ...
2397      PRY       Paraguay  WB_WDI_SI_POV_GINI      Gini index  _T  ...
2398      PER           Peru  WB_WDI_SI_POV_GINI      Gini index  _T  ...
2399      TJK     Tajikistan  WB_WDI_SI_POV_GINI      Gini index  _T  ...
2400      URY        Uruguay  WB_WDI_SI_POV_GINI      Gini index  _T  ...
2401      UZB     Uzbekistan  WB_WDI_SI_POV_GINI      Gini index  _T  ...

                       DATA_SOURCE_LABEL UNIT_TYPE UNIT_TYPE_LABEL  \
0     World Development Indicators (WDI)        IX           Index
1     World Development Indicators (WDI)        IX           Index
2     World Development Indicators (WDI)        IX           Index
3     World Development Indicators (WDI)        IX           Index
4     World Development Indicators (WDI)        IX           Index
...                                  ...       ...             ...
2397  World Development Indicators (WDI)        IX           Index
2398  World Development Indicators (WDI)        IX           Index
2399  World Development Indicators (WDI)        IX           Index
2400  World Development Indicators (WDI)        IX           Index
2401  World Development Indicators (WDI)        IX           Index

     TIME_FORMAT TIME_FORMAT_LABEL COMMENT_OBS OBS_STATUS OBS_STATUS_LABEL  \
0            P1Y            Annual         NaN          A     Normal value
1            P1Y            Annual         NaN          A     Normal value
2            P1Y            Annual         NaN          A     Normal value
3            P1Y            Annual         NaN          A     Normal value
4            P1Y            Annual         NaN          A     Normal value
...          ...               ...         ...        ...              ...
2397         P1Y            Annual         NaN          A     Normal value
2398         P1Y            Annual         NaN          A     Normal value
2399         P1Y            Annual         NaN          A     Normal value
2400         P1Y            Annual         NaN          A     Normal value
2401         P1Y            Annual         NaN          A     Normal value

     OBS_CONF OBS_CONF_LABEL
0          PU         Public
1          PU         Public
2          PU         Public
3          PU         Public
4          PU         Public
...       ...            ...
2397       PU         Public
2398       PU         Public
2399       PU         Public
2400       PU         Public
2401       PU         Public

[2402 rows x 45 columns]>

In [35]:
df["OBS_VALUE"].head()

0    36.7
1    37.4
2    36.8
3    37.1
4    36.9
Name: OBS_VALUE, dtype: float64

In [42]:
df = df[["REF_AREA_LABEL", 'TIME_PERIOD', "OBS_VALUE"]]
df

     REF_AREA_LABEL  TIME_PERIOD  OBS_VALUE
0     United States         1963       36.7
1     United States         1964       37.4
2     United States         1965       36.8
3     United States         1966       37.1
4     United States         1967       36.9
...             ...          ...        ...
2397       Paraguay         2024       44.2
2398           Peru         2024       40.1
2399     Tajikistan         2024       36.1
2400        Uruguay         2024       40.0
2401     Uzbekistan         2024       34.6

[2402 rows x 3 columns]

In [44]:
df_sorted = df.sort_values(by=['REF_AREA_LABEL', 'TIME_PERIOD'], ascending=[True, False])
df

     REF_AREA_LABEL  TIME_PERIOD  OBS_VALUE
0     United States         1963       36.7
1     United States         1964       37.4
2     United States         1965       36.8
3     United States         1966       37.1
4     United States         1967       36.9
...             ...          ...        ...
2397       Paraguay         2024       44.2
2398           Peru         2024       40.1
2399     Tajikistan         2024       36.1
2400        Uruguay         2024       40.0
2401     Uzbekistan         2024       34.6

[2402 rows x 3 columns]

In [48]:
df_latest = df_sorted.drop_duplicates(subset=['REF_AREA_LABEL'], keep='first')
df_latest

          REF_AREA_LABEL  TIME_PERIOD  OBS_VALUE
2119             Albania         2020       29.4
1371             Algeria         2011       27.6
1949              Angola         2018       51.3
2389           Argentina         2024       42.4
2337             Armenia         2023       27.2
...                  ...          ...        ...
2334            Viet Nam         2022       36.1
2388  West Bank and Gaza         2023       36.4
1700         Yemen, Rep.         2014       36.7
2335              Zambia         2022       51.5
2118            Zimbabwe         2019       50.3

[171 rows x 3 columns]

In [49]:
df = df_latest[['REF_AREA_LABEL', 'OBS_VALUE']]
df

          REF_AREA_LABEL  OBS_VALUE
2119             Albania       29.4
1371             Algeria       27.6
1949              Angola       51.3
2389           Argentina       42.4
2337             Armenia       27.2
...                  ...        ...
2334            Viet Nam       36.1
2388  West Bank and Gaza       36.4
1700         Yemen, Rep.       36.7
2335              Zambia       51.5
2118            Zimbabwe       50.3

[171 rows x 2 columns]

In [51]:
df = df.rename(columns={
    'REF_AREA_LABEL': 'Country Name',
    'OBS_VALUE': 'Gini'
})

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 171 entries, 2119 to 2118
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  171 non-null    object
 1   Gini          171 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.0+ KB

In [52]:
znalezione_wartosci = []

for index, row in df.iterrows():
    znaleziona = None
    
    for rok in range(2024, 2000, -1):
        col_name = f"{rok}"
        if col_name in df.columns and row[col_name] != "--":
            znaleziona = row[col_name]

    znalezione_wartosci.append(znaleziona)

df["GDP"] = znalezione_wartosci

print(df[["Country Name", "GDP"]])

                    Country Name               GDP
0                          Aruba  1896456983.24022
1    Africa Eastern and Southern   260992228316.31
2                    Afghanistan  2813571753.87253
3     Africa Western and Central  150058483260.659
4                         Angola  8936079117.73136
..                           ...               ...
261                       Kosovo               NaN
262                  Yemen, Rep.  9852990692.98714
263                 South Africa  135429905922.526
264                       Zambia  4094441301.21423
265                     Zimbabwe  6777385245.70394

[266 rows x 2 columns]

In [53]:
d = df[["Country Name", "GDP"]]

In [53]:
df.to_csv("gini_clean.csv", index=False)

In [42]:
new = df[["Country Name", "Country Code"]]
print(new)

                    Country Name Country Code
0                          Aruba          ABW
1    Africa Eastern and Southern          AFE
2                    Afghanistan          AFG
3     Africa Western and Central          AFW
4                         Angola          AGO
..                           ...          ...
261                       Kosovo          XKX
262                  Yemen, Rep.          YEM
263                 South Africa          ZAF
264                       Zambia          ZMB
265                     Zimbabwe          ZWE

[266 rows x 2 columns]

In [43]:
new.to_csv("data.csv", index=False)

In [44]:
newest = df["GDP"]

In [46]:
newest.to_csv("dane/GDP/only_GDP.csv", index=False)